Revit 2027 API
BuiltInFailures.DividedPathFailures.DividedPathUpdateMergedPointKeysStepFailed Property
 Merging failed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedPathUpdateMergedPointKeysStepFailed { get; }
Public Shared ReadOnly Property DividedPathUpdateMergedPointKeysStepFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedPathUpdateMergedPointKeysStepFailed {
	FailureDefinitionId^ get ();
}
static member DividedPathUpdateMergedPointKeysStepFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedPathFailures Class
Autodesk.Revit.DB Namespace